Autodesk.Revit.DB.DirectContext3D.DrawContext.IsAvailable
Checks whether the facilities of this class are available for use in the current scope.
Remarks:
This class can perform drawing operations and access the state of parameters related to drawing only
in lock-step with rendering inside of Revit. As a consequence, the facilities of this class are not available for
use outside of the scope determined by the callback Autodesk::Revit::DB::DirectContext3D::IDirectContext3DServer::RenderScene(DisplayStyle).
Certain methods of other DirectContext3D objects, e.g., VertexBuffer::Map() are similarly restricted by the same scope.
Returns:
True if the DrawContext is available for rendering, false otherwise.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.DrawContext.IsTransparentPass
Determines whether the current rendering pass is for transparent objects.
Remarks:
Opaque and transparent geometry should be submitted for rendering separately.
See Autodesk::Revit::DB::DirectContext3D::IDirectContext3DServer::UseInTransparentPass(void).
Returns:
True when the server should be submitting transparent objects for rendering, false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This DrawContext is not available because Revit is not currently rendering. In general, this DrawContext must be used in the scope of the RenderScene() callback of IDirectContext3DServer.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.DrawContext
A class that provides drawing functionality for use by DirectContext3D servers
(see Autodesk::Revit::DB::DirectContext3D::IDirectContext3DServer).
Remarks:
The drawing facility of this class is conceptually similar to a low-level graphics API, because
the functionality operates on a set of geometry primitives such as triangles, lines, and points, which are encoded into
a set of vertex and index buffers. Besides submission of geometry in buffers, a major part of the drawing process is
responding to certain changes in graphics state. For example, users of this class can implement progressive rendering
of geometry by testing whether there have been interruptions that should prevent the drawing from being completed.
Since:
2017